var bank = [["nika", 1500],["luka",120], ["ani", 2340], ["mari", 530]]

var pro = prompt("შეიყვანეთ მომხმარებლის სახელი (nika, ani, luka, mari)")

for(var i of bank){
    if(pro == i[0]){
        var ra = prompt("თქვენს ბალანსზეა " + i[1] + ". თუ გსურთ თანხის გატანა შეიყვანეთ 1, თუ გსურთ შეტანა შეიყვანეთ 2")
        if(ra== 1){
            var ramdeni = Number(prompt("რამდენის გატანა გსურთ?"))
            if(i[1]>ramdeni){
                i[1] = i[1] - ramdeni
                console.log("თქვენს ანგარიშზეა - " + i[1])
                var bolo = prompt("თქვენს ანგარიშზე დარჩენილია - " + i[1])
            }
            else{var nak = prompt("შეყვანილი თანხა აჭარბებს ბალანსზე არსებულ თანხას.") }
        }
        else if(ra == 2){
            var ramdeni = Number(prompt("რამდენის შეტანა გსურთ?"))
            i[1] = i[1] + ramdeni
            console.log("თქვენს ანგარიშზეა - " + i[1])
            var bolo = prompt("თქვენს ანგარიშზეა - " + i[1])
        }
    }
}



// ბანკომატი
// ორგანზომილებიან მასივში უდნა იყოს მომხმარებელი და მისი თანხა
// მომხმარებელს უნდა შეეძლოს ბალანსის შემოწმება, თანხის შეტანა ან გამოტანა
